snlkuharlocal/src/DataProcessors/СозданиеИДополнениеЗОГВнеРасписания/СозданиеИДополнениеЗОГВнеРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеИДополнениеЗОГВнеРасписания</name>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ВидыЗавокНаОтргузку/ВидыЗавокНаОтргузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗавокНаОтргузку</name>
  <enumValues>
    <name>Предварительная</name>
  </enumValues>
  <enumValues>
    <name>Окончательная</name>
  </enumValues>
  <enumValues>
    <name>Отгруженная</name>
  </enumValues>
  <enumValues>
    <name>Вспомогательная</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/СозданиеИДополнениеЗОГВнеРасписания/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров=Неопределено) Экспорт
	
	
	СписокСкладов=новый СписокЗначений;
	СтрокаПараметров="";
	ДатаОтгрузки=Неопределено;
	Если ТаблицаПараметров<>Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			СтрокаПараметров=СтрокаПараметров+", Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение;					
			если СтрокаТП.Имя="Склад" тогда
				СписокСкладов.добавить(СтрокаТП.Значение);
			КонецЕсли;
			
			// Кухарь А.Ю. 30.03.2025 начало
			// Пустая задача
			если СтрокаТП.Имя="ДатаОтгрузки" тогда
				ДатаОтгрузки=СтрокаТП.Значение;
			КонецЕсли;			 
			// Кухарь А.Ю. 30.03.2025 конец
			
		КонецЦикла;	
	КонецЕсли;
	
	ЗаписатьВЛог("Регламент",СтрокаПараметров,"Информация");
	если СписокСкладов.Количество()=0 тогда
		ЗаписатьВЛог("Регламент","Нет ни 1го склада в параметрах. Запуск отменен.","Информация");
		Возврат;
	КонецЕсли;
	ЗаписатьВЛог("Регламент","Начало выполнения. "+ТипЗнч(ТаблицаПараметров),"Информация");
	ВидЗаявки=Перечисления.ВидыЗавокНаОтргузку.Вспомогательная;
	
	          
	СписокДатОтгрузки=новый СписокЗначений;
	если ДатаОтгрузки=Неопределено тогда
		// Ихсанов Д. А. Начало 04.06.2026 Наряд 0000000738 от 04.06.2026 17:44:47: e1cib/data/Документ.Наряд?ref=89690050568f680711f16023ee446b60
		//если Час(ТекущаяДата()) < 9 тогда
		//	СписокДатОтгрузки.Добавить(НачалоДня(ТекущаяДата()));
		//иначе
		//	СписокДатОтгрузки.Добавить(КонецДня(ТекущаяДата())+1);
		//КонецЕсли;
		ТекущаяДата = ТекущаяДатаСеанса();
		// Ихсанов Д. А. Начало 18.06.2026 Изменение 0000000070 от 05.06.2026 10:46:32: e1cib/data/Документ.Изменение?ref=89690050568f680711f160b2a681657e
		// Изменен час перехода даты отгрузки с 11-ти часов на константу
//		Если Час(ТекущаяДата) <= 11 Тогда
		ЧасПереходаДатыОтгрузки = Константы.ЧасПереходаДатыОтгрузки.Получить();
		Если Не ЗначениеЗаполнено(ЧасПереходаДатыОтгрузки) Тогда
			ВызватьИсключение "Не заполнен час перехода даты отгруки!"
		КонецЕсли;
		
		Если Час(ТекущаяДата) <= ЧасПереходаДатыОтгрузки Тогда
		// Ихсанов Д. А. Конец 18.06.2026
			СписокДатОтгрузки.Добавить(НачалоДня(ТекущаяДата));
		Иначе
			СписокДатОтгрузки.Добавить(КонецДня(ТекущаяДата) + 1);
		КонецЕсли;
		// Ихсанов Д. А. Конец 04.06.2026
	иначе
		СписокДатОтгрузки.Добавить(ДатаОтгрузки);
	КонецЕсли;
	
	Для каждого СтрДаты из СписокДатОтгрузки цикл
		ДатаОтгрузки=СтрДаты.Значение;
		для каждого СтрСписка из СписокСкладов цикл
			Склад=СтрСписка.Значение;
			ЗаписатьВЛог("Регламент","Формирование ЗОГ по складу: "+Склад+", вид: "+ВидЗаявки+" Дата отгрузки:"+Строка(ДатаОтгрузки),"Информация");			
			Запрос=новый запрос;
			запрос.Текст="ВЫБРАТЬ
			|	ЗаявкаНаОтгрузку.Ссылка КАК ЗОГ
			|ИЗ
			|	Документ.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку
			|ГДЕ
			|	ЗаявкаНаОтгрузку.ДатаОтгрузки = &Дата
			|	И ЗаявкаНаОтгрузку.Склад = &Склад";
			запрос.УстановитьПараметр("Дата",ДатаОтгрузки);
			запрос.УстановитьПараметр("Склад",Склад);
			результат=запрос.Выполнить().Выгрузить();
			
			Если результат.Количество()=0 Тогда
				ДокОбъект=Документы.ЗаявкаНаОтгрузку.СоздатьДокумент();		
				ДокОбъект.Дата=ДатаОтгрузки;
				ЗаполнитьШапкуДокумента(ДокОбъект,ПараметрыСеанса.Пользователь);
			Иначе
				ДокОбъект=результат.Получить(0).ЗОГ.ПолучитьОбъект();			
			КонецЕсли; 
			
			ДокОбъект.ВидЗаявки	=ВидЗаявки;
			ДокОбъект.Склад		=Склад;			
			
			ЗаполнитьЗаявкуНаОтгрузкуЛокальная(ДокОбъект);			
			
			Если ДокОбъект.ПометкаУдаления Тогда
				ДокОбъект.ПометкаУдаления=Ложь;				
			КонецЕсли;
			
			Если ДокОбъект.Накладные.Количество()>0 Тогда
				ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад;
				попытка
					//Пока тест
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					ЗаписатьВЛог("Регламент","Документ записан!","Информация");	
				исключение
					ЗаписатьВЛог("Регламент","Документ не записан !"+ДокОбъект+ " "+ОписаниеОшибки(),"Информация");	
				КонецПопытки;	
			Иначе
				ЗаписатьВЛог("Регламент","На "+ДатаОтгрузки+" не обнаружено накладных !","Информация");					
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	ЗаписатьВЛог("Регламент","Завершение выполнения.","Информация");
КонецПроцедуры

Процедура ЗаполнитьЗаявкуНаОтгрузкуЛокальная (ДокОбъект)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	""РНК"" КАК Вид,
	|	Накладная.Ссылка КАК Ссылка,
	|	Накладная.СостояниеНакладной КАК СостояниеНакладной
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Накладная
	|ГДЕ
	|	Накладная.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Накладная.Проведен
	|	И Накладная.Отгружен В(&Отгружен)
	|	И Накладная.Склад = &Склад
	|	И Накладная.ДатаОтгрузки = &ДатаОтгрузки
	// Кухарь А.Ю.  04.10.2022 начало
	//	             |	И Накладная.СостояниеНакладной <> &ВРаботе";
	|	И не Накладная.СостояниеНакладной в (&СписокНедопустимыхСостояний)";				  
	// Кухарь А.Ю.  04.10.2022 конец
	
	
	
	Запрос.УстановитьПараметр("Дата1",			ДокОбъект.Дата-30*24*60*60);
	Запрос.УстановитьПараметр("Дата2",			КонецДня(ДокОбъект.Дата));
	Запрос.УстановитьПараметр("Склад",			ДокОбъект.Склад);
	Запрос.УстановитьПараметр("ДатаОтгрузки",	НачалоДня(ДокОбъект.Дата));
	//  15.02.2022 начало
	//
	
	//  15.02.2022 конец
	
	// Кухарь А.Ю.  04.10.2022 начало
	// Запрос.УстановитьПараметр("ВРаботе",	Перечисления.СостоянияНакладной.ВРаботе);
	СписокНедопустимыхСостояний=новый СписокЗначений;
	СписокНедопустимыхСостояний.Добавить(Перечисления.СостоянияНакладной.ВРаботе);
	СписокНедопустимыхСостояний.Добавить(Перечисления.СостоянияНакладной.Отменена);
	СписокНедопустимыхСостояний.Добавить(Перечисления.СостоянияНакладной.Принята);
	
	Запрос.УстановитьПараметр("СписокНедопустимыхСостояний",	СписокНедопустимыхСостояний);
	// Кухарь А.Ю.  04.10.2022 конец
	
	
	Отгружен=Новый Массив;
	Отгружен.Добавить(Перечисления.Отгружен.Резерв);
	Отгружен.Добавить(Перечисления.Отгружен.ОтгруженТранзит);
	
	Запрос.УстановитьПараметр("Отгружен",		Отгружен);	
	
	Запрос.УстановитьПараметр("Состояние_ВРаботе",			Перечисления.СостоянияНакладной.ВРаботе);
	Запрос.УстановитьПараметр("Состояние_ГотоваКОтгрузке",	Перечисления.СостоянияНакладной.ГотоваКОтгрузке);	
	Если 1=2 Тогда
		ДокОбъект=Документы.ЗаявкаНаОтгрузку.СоздатьДокумент();	
	КонецЕсли; 
	
	
	
	
	Для Каждого СтрокаТЧ Из ДокОбъект.Накладные Цикл
		Если СтрокаТЧ.Накладная.ДатаОтгрузки<>НачалоДня(ДокОбъект.Дата) ИЛИ НЕ СтрокаТЧ.Накладная.Проведен Тогда
			СтрокаТЧ.НеОтгружать=Истина;
			ЗаписатьВЛог("Формирование ЗОГ","Снят с отгрузки документ. Неверная дата отгрузки "+СтрокаТЧ.Накладная,"Информация");
		ИначеЕсли СтрокаТЧ.Накладная.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе тогда
			СтрокаТЧ.НеОтгружать=Истина;
			ЗаписатьВЛог("Формирование ЗОГ","Снят с отгрузки документ. Состояние 'в работе' "+СтрокаТЧ.Накладная,"Информация");
		иначе
			СтрокаТЧ.НеОтгружать=ложь;
		КонецЕсли;	
	КонецЦикла;	
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		СтрокаТЧ=ДокОбъект.Накладные.Найти(Выборка.Ссылка,"Накладная");
		Если СтрокаТЧ=Неопределено Тогда
			СтрокаТЧ=ДокОбъект.Накладные.Добавить();		
		КонецЕсли;	
		ДокОбъект.ЗаполнитьСтрокуПоНакладной(СтрокаТЧ,Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры
